#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.db.random_password.master_password[0]: Refreshing state... [id=none]
module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=B-8XEQ]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03f99d7f0db04e8ef]
aws_cloudwatch_log_group.logs: Refreshing state... [id=amigo-oculto]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=amigo-oculto-20220607174825040800000001]
aws_lb_target_group.frontend: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:130139148959:targetgroup/frontend/1687b418560a0257]
module.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=amigo-oculto-20220607174651676900000002]
aws_lb_target_group.backend: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:130139148959:targetgroup/backend/eabfcc3cf16c6cbd]
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.ecs_tasks_execution_role: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
data.aws_iam_policy_document.ecs_autoscale_role: Reading...
data.aws_iam_policy_document.ecs_tasks_execution_role: Read complete after 0s [id=320642683]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
data.aws_iam_policy_document.ecs_autoscale_role: Read complete after 0s [id=3468681342]
module.db.module.db_instance.data.aws_partition.current: Reading...
aws_ecs_cluster.cluster_ecs: Refreshing state... [id=arn:aws:ecs:us-east-2:130139148959:cluster/amigo-oculto]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.ecs_tasks_execution_role: Refreshing state... [id=amigo-oculto-ecs-task-execution-role]
aws_iam_role.ecs_autoscale_role: Refreshing state... [id=ecs-scale-amigo-oculto]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-075b90fd1177ce0b9]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d637798586ff49bb]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b8d4ce02db04840d]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=amigo-oculto]
aws_iam_role_policy_attachment.ecs_tasks_execution_role: Refreshing state... [id=amigo-oculto-ecs-task-execution-role-20220607183240711900000004]
aws_ecs_task_definition.frontend: Refreshing state... [id=amigo-oculto-frontend]
aws_ecs_task_definition.backend: Refreshing state... [id=amigo-oculto-backend]
aws_iam_role_policy_attachment.ecs_cloudwatch: Refreshing state... [id=ecs-scale-amigo-oculto-20220607183240917700000005]
aws_iam_role_policy_attachment.ecs_autoscale: Refreshing state... [id=ecs-scale-amigo-oculto-20220607183240709200000003]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ff4c31866b08dfd2]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06fc2e1ab86624082]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-010b351a8d5d9e6a9]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-072d3e61289094707]
module.db_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-08800afad0112f4f5]
module.frontend_lb_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03a5b38baf76d9d72]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-02fb1add93960d33b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-023e56bf0ae4af6fb]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-04acda6553410ab56]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0adcedbe2758092bd]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0941f512d54f15046]
module.frontend_service_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0cc7e5b40ef680c79]
module.backend_lb_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0fdb4650ab0a02186]
module.backend_service_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-070db456cea294f36]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b824bc893c403af0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02f77cc9bcbc026bf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-054ea7573cf33fc47]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-023e56bf0ae4af6fb1080289494]
aws_lb.frontend: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:130139148959:loadbalancer/app/amigo-oculto-frontend/0b599b87447de512]
module.frontend_lb_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-909833955]
module.frontend_lb_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2684741404]
module.frontend_lb_security_group.aws_security_group_rule.egress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-4156122249]
module.db_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2423601628]
module.db_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1449776862]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0558824340d7d0d7c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-089055ae3a10b0789]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-081238b88ff2507e8]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08d212e532c4cac7a]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0baab7059cbf28e7e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-034f56718900e6450]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-06a0fb8d6392682b5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0939af8a44cd091df]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b56e3205bf398a76]
module.frontend_service_security_group.aws_security_group_rule.egress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-1717937127]
module.frontend_service_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3059328555]
module.frontend_service_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1265430094]
module.backend_lb_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-892688003]
module.backend_lb_security_group.aws_security_group_rule.egress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-2747936544]
aws_lb.backend: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:130139148959:loadbalancer/app/amigo-oculto-backend/812f71caa508ccf5]
module.backend_lb_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3675084662]
module.backend_service_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3031291112]
module.backend_service_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-450609530]
module.backend_service_security_group.aws_security_group_rule.egress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-370382731]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0adcedbe2758092bd1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0941f512d54f150461080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-02fb1add93960d33b1080289494]
aws_lb_listener.frontend: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:130139148959:listener/app/amigo-oculto-frontend/0b599b87447de512/e6cbfdac02d7f8dd]
aws_lb_listener.backend: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:130139148959:listener/app/amigo-oculto-backend/812f71caa508ccf5/a27a62925b0a7c1d]
aws_ecs_service.frontend: Refreshing state... [id=arn:aws:ecs:us-east-2:130139148959:service/amigo-oculto/frontend]
aws_ecs_service.backend: Refreshing state... [id=arn:aws:ecs:us-east-2:130139148959:service/amigo-oculto/backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.backend will be updated in-place
  ~ resource "aws_ecs_service" "backend" {
        id                                 = "arn:aws:ecs:us-east-2:130139148959:service/amigo-oculto/backend"
        name                               = "backend"
        tags                               = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-service-backend"
            "Terraform"   = "true"
        }
      ~ task_definition                    = "amigo-oculto-backend:6" -> "amigo-oculto-backend"
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.frontend will be updated in-place
  ~ resource "aws_ecs_service" "frontend" {
        id                                 = "arn:aws:ecs:us-east-2:130139148959:service/amigo-oculto/frontend"
        name                               = "frontend"
        tags                               = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-service-frontend"
            "Terraform"   = "true"
        }
      ~ task_definition                    = "amigo-oculto-frontend:1" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.frontend must be replaced
-/+ resource "aws_ecs_task_definition" "frontend" {
      ~ arn                      = "arn:aws:ecs:us-east-2:130139148959:task-definition/amigo-oculto-frontend:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ environment      = [
                      + {
                          + name  = "API_BASE_URL"
                          + value = "http://api.mumuz.in/v1"
                        },
                    ]
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                    name             = "frontend"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (2 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "amigo-oculto-frontend" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @samuelbraga, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/ci_iac_workflow.yaml`*